Repository: Gliese-876/Course-Planner
Catalog: CoursePlanner.Application/Resources/*/Resources.resw
Source language: en_us
Languages: zh_hans

# ExportWeekSubtitleFormat
source: {0} / {1} / Week {2} / {3}
zh_hans: {0} / {1} / 第 {2} 周 / {3}

# ExportWeekRangeSubtitleFormat
source: {0} / {1} / Weeks {2}-{3} / {4} - {5}
zh_hans: {0} / {1} / 第 {2}-{3} 周 / {4} - {5}

# ExportDetailedSemesterSubtitleFormat
source: {0} / {1} / entire semester / Weeks 1-{2} / {3} - {4}
zh_hans: {0} / {1} / 整个学期 / 第 1-{2} 周 / {3} - {4}

# ExportWeekHeadingFormat
source: Week {0}
zh_hans: 第 {0} 周

# MondayShort
source: Mon
zh_hans: 周一

# TuesdayShort
source: Tue
zh_hans: 周二

# WednesdayShort
source: Wed
zh_hans: 周三

# ThursdayShort
source: Thu
zh_hans: 周四

# FridayShort
source: Fri
zh_hans: 周五

# SaturdayShort
source: Sat
zh_hans: 周六

# SundayShort
source: Sun
zh_hans: 周日

source: Before semester
zh_hans: 学期开始前

source: After semester
zh_hans: 学期结束后

# WeekCourseCount
source: Week {0}: {1} · {2} course(s)
zh_hans: 第 {0} 周：{1} · {2} 门课程

# CourseTypeGeneral
source: General
zh_hans: 通识

# CourseTypeMajor
source: Major
zh_hans: 专业

# CourseTypeFree
source: Free
zh_hans: 自由

# StudyTypeCore
source: Core
zh_hans: 核心

source: Required
zh_hans: 必修

source: Elective
zh_hans: 选修

source: Morning
zh_hans: 上午

source: Project
zh_hans: 项目

source: Uncategorized
zh_hans: 未分类

# UnsavedCourseEditReminder
source: You are editing a course. Saving updates the course library and every plan that references this course.
zh_hans: 正在编辑课程。保存后会更新课程库，并同步到所有引用该课程的方案。

source: Detail notices
zh_hans: 详情提醒

# BulkAddSummary
source: {0} will be added to {1} target plan(s).
zh_hans: {0} 将加入 {1} 个目标方案。

# PlanPickerSummary
source: {0} · {1} cr · {2} course(s) · {3}
zh_hans: {0} · {1} 学分 · {2} 门课程 · {3}

# EditCourseInLibrary
source: Edit library course
zh_hans: 编辑课程库课程

# LibraryCourseSynced
source: Library course saved and synced to plans that use it.
zh_hans: 课程库课程已保存，并已同步到使用该课程的方案。

source: Unknown
zh_hans: 未知

# MeetingTimeFormat
source: {0} periods {1}-{2}, weeks {3}
zh_hans: {0} {1}-{2} 节 {3}

# PlanTextWeekLine
source: Week {0}: {1}
zh_hans: 第 {0} 周：{1}

# PlanTextSummaryLine
source: Credits: {0:0.##}; Courses: {1}
zh_hans: 学分：{0:0.##}；课程：{1}

# PlanTextCourseHeader
source: - {0} ({1:0.##} credits)
zh_hans: - {0}（{1:0.##} 学分）

# PlanTextTeacherLine
source: Teacher: {0}
zh_hans: 教师：{0}

# PlanTextLocationLine
source: Location: {0}
zh_hans: 地点：{0}

# PlanTextTimeLine
source: Time: {0}
zh_hans: 时间：{0}

# PlanTextCapacityLine
source: Capacity: {0}
zh_hans: 容量：{0}

# PlanTextNotesLine
source: Notes: {0}
zh_hans: 备注：{0}

# ImportPreviewReportTitle
source: Import preview: {0}, schema {1}
zh_hans: 导入预览：{0}，架构 {1}

# ImportPreviewVisibleItems
source: Visible items: {0} / {1}
zh_hans: 可见条目：{0} / {1}

# ImportPreviewDisplayLimit
source: The preview displays the first {0} of {1} matching items. Save the report to include every item.
zh_hans: 预览仅显示 {1} 个匹配项中的前 {0} 个；保存报告可包含全部项目。

# ImportPreviewReportWarning
source: warning: {0}
zh_hans: 警告：{0}

# ImportPreviewReportError
source: error: {0}
zh_hans: 错误：{0}

# ImportStatus.Added
source: Added
zh_hans: 新增

# ImportStatus.Updated
source: Updated
zh_hans: 更新

# ImportStatus.Skipped
source: Skipped
zh_hans: 跳过

# ImportStatus.Conflict
source: Conflict
zh_hans: 冲突

# ImportStatus.Warning
source: Warning
zh_hans: 警告

# ImportStatus.NotImportable
source: Not importable
zh_hans: 不可导入

# ImportKind.courseLibrary
source: Course library
zh_hans: 课程库

# ImportKind.selectionPlan
source: Selection plan
zh_hans: 选课方案

# ImportKind.file
source: File
zh_hans: 文件

# ImportKind.semester
source: Semester
zh_hans: 学期

# ImportKind.label
source: Label
zh_hans: 标签

# ImportKind.course
source: Course
zh_hans: 课程

# ImportKind.plan
source: Plan
zh_hans: 方案

# ImportKind.planCourse
source: Plan course
zh_hans: 方案课程

# Import.UnknownJsonKind
source: JSON kind must be courseLibrary or selectionPlan.
zh_hans: JSON kind 必须是 courseLibrary 或 selectionPlan。

# Import.InvalidJson
source: This file is not valid Course Planner JSON.
zh_hans: 该文件不是有效的 Course Planner JSON。

# Import.FileTooLarge
source: The import file is too large.
zh_hans: 导入文件过大。

# Import.UnsupportedSchemaVersion
source: This import package version is not supported.
zh_hans: 不支持该导入包版本。

# Import.PackageTooLarge
source: This import package contains too many items or oversized fields.
zh_hans: 导入包项目过多或字段过大。

# Import.SemesterIdentityConflict
source: A local semester named '{0}' has the same hidden identity. Forced merge will import into the local semester name.
zh_hans: 本地学期“{0}”拥有相同隐藏身份；强制合并会导入到该本地学期名下。

# Import.SemesterSettingsDiffer
source: Imported semester settings differ from local settings.
zh_hans: 导入的学期设置与本地设置不同。

# Import.CourseMissingSemester
source: Course references a missing semester.
zh_hans: 课程引用的学期不存在。

# Import.CourseSemesterNameConflict
source: This course belongs to a semester name conflict and requires forced merge.
zh_hans: 该课程属于存在名称冲突的学期，需要强制合并。

# Import.PlanNameExists
source: A plan with this name already exists in the target semester.
zh_hans: 目标学期中已存在同名方案。

# Import.PlanSemesterNameConflict
source: This plan belongs to a semester name conflict and requires forced merge.
zh_hans: 该方案属于存在名称冲突的学期，需要强制合并。

# Import.PlanCoursePackageIncomplete
source: The plan package is missing course data: {0}
zh_hans: 方案包缺少课程数据：{0}

# Import.PlanCourseNotImportable
source: The plan requires course data that cannot be imported safely: {0}
zh_hans: 方案依赖了无法安全导入的课程数据：{0}

# Import.PlanSemesterInvalid
source: The plan semester is invalid.
zh_hans: 方案所属学期无效。

# Validation.SemesterRequired
source: A semester is required.
zh_hans: 必须选择一个学期。

# Validation.SemesterEditSourceMissing
source: The semester being edited no longer exists. Reload the list and try again.
zh_hans: 正在编辑的学期已不存在，请刷新列表后重试。

# Validation.SemesterNameRequired
source: Semester name is required.
zh_hans: 学期名称不能为空。

# Validation.SemesterNameDuplicate
source: Semester names must be globally unique.
zh_hans: 学期名称必须全局唯一。

# Validation.SemesterDateRange
source: Semester end date cannot be before start date.
zh_hans: 学期结束日期不能早于开始日期。

# Validation.SemesterDateSupportedRange
source: Semester dates must be between {0} and {1}.
zh_hans: 学期日期必须位于 {0} 至 {1} 年之间。

# Validation.SemesterWeekCount
source: Week count must be at least 1.
zh_hans: 周数必须至少为 1。

# Validation.PeriodScheduleRequired
source: At least one period definition is required.
zh_hans: 至少需要一个节次定义。

# Validation.SemesterEndDateWeekCountMismatch
source: End date and week count are inconsistent.
zh_hans: 结束日期与周数不一致。

# Validation.PeriodNumber
source: Period number must be positive.
zh_hans: 节次编号必须为正数。

# Validation.PeriodTimeRange
source: Period end time must be after start time.
zh_hans: 节次结束时间必须晚于开始时间。

# Validation.PeriodNumberSequence
source: Period numbers must be consecutive starting from 1.
zh_hans: 节次必须从 1 开始连续编号。

# Validation.CourseNameRequired
source: Course name is required.
zh_hans: 课程名称不能为空。

# Validation.CreditsNonNegative
source: Credits cannot be negative.
zh_hans: 学分不能为负数。

# Validation.MeetingTimeRequired
source: At least one meeting time is required.
zh_hans: 至少需要一个上课时间。

# Validation.InvalidCourseColor
source: Course color must be #RRGGBB.
zh_hans: 课程色必须是 #RRGGBB。

# Validation.InvalidCourseColorRegenerated
source: Invalid course color will be replaced with a recommended color.
zh_hans: 无效课程色会自动替换为推荐色。

# Validation.InvalidWeekday
source: Weekday must be 1 (Monday) through 7 (Sunday).
zh_hans: 星期必须为 1（周一）到 7（周日）。

# Validation.InvalidWeekParity
source: Week parity must be every week, odd weeks, or even weeks.
zh_hans: 单双周必须为每周、单周或双周。

# Validation.InvalidPeriodRange
source: Start period cannot be after end period.
zh_hans: 开始节次不能晚于结束节次。

# Validation.PeriodOutOfRange
source: Some periods are outside the semester schedule.
zh_hans: 部分节次超出学期节次表。

# Validation.InvalidWeeks
source: Invalid week expression: {0}
zh_hans: 周次表达式无效：{0}

# Validation.WeeksOutOfRange
source: Some meeting weeks are outside the semester range.
zh_hans: 部分上课周超出学期范围。

# Validation.WeeksParsingBounded
source: The week expression was too large and was parsed with safety limits.
zh_hans: 周次表达式过大，已按安全上限解析。

# Validation.CourseCompletelyInvisible
source: All meeting times are outside visible semester weeks or periods.
zh_hans: 所有上课时间都不在可见学期周次或节次内。

# Validation.FileNameRequired
source: Name is required.
zh_hans: 名称不能为空。

# Validation.FileNameTrailing
source: Names used for exports cannot end with a space or dot.
zh_hans: 用于导出的名称不能以空格或句点结尾。

# Validation.FileNameIllegalCharacters
source: Names used for exports cannot contain: < > : " / \ | ? *
zh_hans: 用于导出的名称不能包含：< > : " / \ | ? *

# Validation.FileNameReserved
source: This name is reserved by Windows.
zh_hans: 该名称是 Windows 保留名称。

# Validation.FileNameTooLong
source: Names used for exports cannot exceed {0} characters.
zh_hans: 用于导出的名称不能超过 {0} 个字符。

# Validation.LabelKindInUse
source: A label used by one or more courses cannot change category. Remove its course references first.
zh_hans: 已被课程使用的标签不能更改类别。请先移除课程中的对应引用。

# Validation.LabelEditSourceMissing
source: The label being edited no longer exists. Reload the list and try again.
zh_hans: 正在编辑的标签已不存在，请刷新列表后重试。

# Validation.PeriodTimeOverlap
source: Class period times must be ordered and cannot overlap adjacent periods.
zh_hans: 课节时间必须按顺序排列，且不能与相邻课节重叠。

# Validation.MeetingTimesOverlap
source: Meeting times for the same course cannot overlap.
zh_hans: 同一课程的上课时间不能相互重叠。

# Validation.InvalidWeekStartDay
source: The selected week start day is invalid.
zh_hans: 所选每周起始日无效。

# Validation.ReferencedCourseSemesterChange
source: A course used by a plan cannot be moved to another semester. Copy it to the target semester instead.
zh_hans: 已被方案使用的课程不能移动到其他学期。请改为将课程复制到目标学期。

# Validation.CourseEditNotActive
source: There is no active course edit to save.
zh_hans: 当前没有可保存的课程编辑。

# Validation.CourseEditSourceMissing
source: The course being edited no longer exists. Reopen the course library before saving.
zh_hans: 正在编辑的课程已不存在。请重新打开课程库后再保存。

# Validation.CourseIdentityDuplicate
source: Another course already has the same semester, name, teacher, location, and meeting times.
zh_hans: 已有另一门课程具备相同的学期、课程名、教师、地点和上课时间。

# Validation.LabelNameRequired
source: Label name is required.
zh_hans: 标签名称不能为空。

# Validation.LabelNameDuplicate
source: Label names must be globally unique.
zh_hans: 标签名称必须全局唯一。

# Validation.PlanNameUnique
source: Plan names must be unique within the same semester.
zh_hans: 同一学期内方案名必须唯一。

# Validation.CreditsRequired
source: Credits must be a finite number.
zh_hans: 学分必须是有限数值。

# Validation.CreditsMaximum
source: Credits cannot exceed {0}.
zh_hans: 学分不能超过 {0}。

# Validation.EnrolledNonNegative
source: Enrollment cannot be negative.
zh_hans: 已选人数不能为负数。

# Validation.EnrolledMaximum
source: Enrollment cannot exceed {0}.
zh_hans: 已选人数不能超过 {0}。

# Validation.EnrolledWholeNumber
source: Enrollment must be a whole number.
zh_hans: 已选人数必须是整数。

# Validation.CapacityNonNegative
source: Capacity cannot be negative.
zh_hans: 课容量不能为负数。

# Validation.CapacityMaximum
source: Capacity cannot exceed {0}.
zh_hans: 课容量不能超过 {0}。

# Validation.CapacityWholeNumber
source: Capacity must be a whole number.
zh_hans: 课容量必须是整数。

# Validation.EnrolledExceedsCapacity
source: Enrollment exceeds the positive capacity.
zh_hans: 已选人数超过了正数课容量。

# Validation.CourseNameTooLong
source: Course name cannot exceed {0} characters.
zh_hans: 课程名称不能超过 {0} 个字符。

# Validation.TeacherTooLong
source: Teacher cannot exceed {0} characters.
zh_hans: 教师名称不能超过 {0} 个字符。

# Validation.LocationTooLong
source: Location cannot exceed {0} characters.
zh_hans: 上课地点不能超过 {0} 个字符。

# Validation.CourseGroupTypeTooLong
source: Course group type cannot exceed {0} characters.
zh_hans: 课程类别不能超过 {0} 个字符。

# Validation.StudyTypeTooLong
source: Study type cannot exceed {0} characters.
zh_hans: 修读性质不能超过 {0} 个字符。

# Validation.CourseNotesTooLong
source: Course notes cannot exceed {0} characters.
zh_hans: 课程备注不能超过 {0} 个字符。

# Validation.CourseColorTooLong
source: Course color text cannot exceed {0} characters.
zh_hans: 课程颜色文本不能超过 {0} 个字符。

# Validation.CourseLabelTooLong
source: Each course label cannot exceed {0} characters.
zh_hans: 每个课程标签不能超过 {0} 个字符。

# Validation.CourseLabelsMaximum
source: A course can contain at most {0} ordinary labels.
zh_hans: 每门课程最多可包含 {0} 个普通标签。

# Validation.MeetingTimesMaximum
source: A course can contain at most {0} meeting times.
zh_hans: 每门课程最多可包含 {0} 个上课时间。

# Validation.MeetingWeeksTooLong
source: A meeting week expression cannot exceed {0} characters.
zh_hans: 上课周次表达式不能超过 {0} 个字符。

# Validation.SemesterNameTooLong
source: Semester name cannot exceed {0} characters.
zh_hans: 学期名称不能超过 {0} 个字符。

# Validation.PeriodScheduleMaximum
source: A semester can contain at most {0} class periods.
zh_hans: 每个学期最多可包含 {0} 个节次。

# Validation.InvalidLabelKind
source: The selected label category is invalid.
zh_hans: 所选标签类别无效。

# Validation.LabelNameTooLong
source: Label name cannot exceed {0} characters.
zh_hans: 标签名称不能超过 {0} 个字符。

# Validation.LabelCatalogMaximum
source: The label catalog can contain at most {0} labels.
zh_hans: 标签库最多可包含 {0} 个标签。

# Validation.PlanNameRequired
source: Plan name is required.
zh_hans: 方案名称不能为空。

# Validation.PlanNameTooLong
source: Plan name cannot exceed {0} characters.
zh_hans: 方案名称不能超过 {0} 个字符。

# Validation.PlanSnapshotsMaximum
source: A plan can contain at most {0} courses.
zh_hans: 每个方案最多可包含 {0} 门课程。

# Validation.PlanCatalogMaximum
source: The plan catalog can contain at most {0} plans.
zh_hans: 方案库最多可包含 {0} 个方案。

# Validation.OpenPlanTabsMaximum
source: At most {0} plan tabs can be open at once. Close a plan tab before opening another.
zh_hans: 最多只能同时打开 {0} 个方案标签。请先关闭一个方案标签再打开其他方案。

# Validation.PlanUnavailable
source: The selected plan is no longer available.
zh_hans: 所选方案已不可用。

# Validation.SemesterCatalogMaximum
source: The semester catalog can contain at most {0} semesters.
zh_hans: 学期库最多可包含 {0} 个学期。

# Validation.CourseCatalogMaximum
source: The course library can contain at most {0} courses.
zh_hans: 课程库最多可包含 {0} 门课程。

# Validation.TotalSnapshotsMaximum
source: All plans together can contain at most {0} course references.
zh_hans: 所有方案合计最多可包含 {0} 条课程引用。

# Validation.TotalLabelReferencesMaximum
source: All courses together can contain at most {0} label references.
zh_hans: 所有课程合计最多可包含 {0} 条标签引用。

# Validation.AggregateTextMaximum
source: The total stored text cannot exceed {0} characters.
zh_hans: 全部已存储文本合计不能超过 {0} 个字符。

# Validation.PlanMeetingRowsMaximum
source: A plan can reference at most {0} meeting rows across its distinct courses.
zh_hans: 单个方案引用的去重课程合计最多只能包含 {0} 条上课时间。

# TimetableDenseModeTitle
source: Dense timetable · virtualized list
zh_hans: 高密度课表 · 虚拟化列表

# TimetableDenseModeMessage
source: All {0} visible course blocks are listed below. A full grid would create about {1} interface elements, so the virtualized list keeps the app responsive without omitting courses.
zh_hans: 下方完整列出当前可见的 {0} 个课程块。完整网格预计会创建约 {1} 个界面元素，因此改用虚拟化列表以保持响应，且不会省略课程。

# ExportLimit.CourseBlocks
source: This export would render {0} course blocks; the safe limit is {1}. Choose a smaller week range.
zh_hans: 本次导出需要绘制 {0} 个课程块，安全上限为 {1} 个。请选择更小的周范围。

# ExportLimit.TextCharacters
source: This export would lay out {0} text characters; the safe limit is {1}. Choose fewer weeks or course fields.
zh_hans: 本次导出需要排版 {0} 个文本字符，安全上限为 {1} 个。请减少周数或课程字段。

# ExportLimit.ConflictLanes
source: A timetable cell requires {0} conflict lanes; the safe limit is {1}. Export a less dense plan.
zh_hans: 一个课表单元格需要 {0} 条冲突分栏，安全上限为 {1} 条。请选择密度较低的方案。

# ExportLimit.BitmapMemory
source: The PNG needs about {0} bytes of peak bitmap and encoder memory; the safe limit is {1}. Lower the clarity or use PDF.
zh_hans: PNG 位图与编码器的峰值内存约需 {0} 字节，安全上限为 {1} 字节。请降低清晰度或改用 PDF。

# ExportLimit.SurfaceDimension
source: The PNG dimension is {0} pixels; the supported limit is {1}. Lower the clarity or use PDF.
zh_hans: PNG 尺寸为 {0} 像素，支持的上限为 {1} 像素。请降低清晰度或改用 PDF。

# ExportLimit.VectorDimension
source: The timetable dimension is {0} logical pixels; the supported limit is {1}. Choose fewer weeks or course fields.
zh_hans: 课表尺寸为 {0} 个逻辑像素，支持的上限为 {1} 个。请减少周数或课程字段。
